app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."table_id" = $1 ORDER BY "reservations"."starts_at" ASC  [["table_id", 1]]
---
  def index
    @reservations = @table.reservations.order(:starts_at)

INSERT INTO "reservations" ("table_id", "starts_at", "ends_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["table_id", 1], ["starts_at", "2017-11-03 10:00:00"], ["ends_at", "2017-11-03 11:00:00"], ["created_at", "2017-11-03 16:46:42.686079"], ["updated_at", "2017-11-03 16:46:42.686079"]]
---
  def create
    @reservation = @table.reservations.build(reservation_params)

    respond_to do |format|
      if @reservation.save

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "tables".* FROM "tables" WHERE "tables"."restaurant_id" = $1 AND "tables"."id" = $2 LIMIT $3  [["restaurant_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_restaurant_table
    @restaurant = Restaurant.find(params[:restaurant_id])
    @table = @restaurant.tables.find(params[:table_id])

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."table_id" = $1 AND "reservations"."id" = $2 LIMIT $3  [["table_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_reservation
    @reservation = @table.reservations.find(params[:id])