app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
  def index
    @restaurants = Restaurant.all

INSERT INTO "restaurants" ("name", "address", "subway", "opened_at", "closed_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @restaurant = Restaurant.new(restaurant_params)

    respond_to do |format|
      if @restaurant.save

UPDATE "restaurants" SET "opened_at" = $1, "closed_at" = $2, "updated_at" = $3 WHERE "restaurants"."id" = $4  [["opened_at", "00:00:00"], ["closed_at", "23:59:00"], ["updated_at", "2017-11-03 16:55:17.103378"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @restaurant.update(restaurant_params)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_restaurant
      @restaurant = Restaurant.find(params[:id])