app/controllers/tables_controller.rb

  def create
    @table = @restaurant.tables.build(table_params)

    respond_to do |format|
      if @table.save
---
INSERT INTO "tables" ("restaurant_id", "number_table", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["restaurant_id", 1], ["number_table", 1], ["created_at", "2017-11-03 16:26:28.739718"], ["updated_at", "2017-11-03 16:26:28.739718"]]

  def set_restaurant
    @restaurant = Restaurant.find(params[:restaurant_id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_table
    @table = @restaurant.tables.find(params[:id])
---
SELECT  "tables".* FROM "tables" WHERE "tables"."restaurant_id" = $1 AND "tables"."id" = $2 LIMIT $3  [["restaurant_id", 1], ["id", 1], ["LIMIT", 1]]